# Реализовать алгоритм перемешивания списка. 

import random

numbers = [1, 2, 3, 4, 5, 6, 7, 8]

random.shuffle(numbers)
print(numbers)