#q = int(input('Введите день:'))
#if q == 1:
#    print('Понедельник')
#if q == 2:
#    print('Вторник')
#if q == 3:
#    print('Среда')
#if q == 4:
#    print('Четверг')
#if q == 5:
#    print('Пятница')
#if q == 6:
#    print('Суббота, ВЫХОДНОЙ')
#if q == 7:
#    print('Воскресенье, ВЫХОДНОЙ') 

n = int(input('Введите день:'))
res = ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"]
print(res[n-1])
if 0 <= n <= 5:
    print('Будни')
else: 
    print('Выходной')                                 